[
  {
    "id": "1",
    "position": "junior frontend developer",
    "company": "BazaTrainee Ukraine",
    "period": "2023 - now",
    "info": "",
    "duties": [
      "Developing and maintaining user-facing features for web applications using HTML, CSS, and JavaScript.",
      "Assisting in the design of web application layouts, ensuring responsiveness and cross-browser compatibility.",
      "Collaborating with back-end developers and web designers to improve usability and meet project requirements.",
      "Debugging and troubleshooting website problems, and implementing fixes in a timely manner.",
      "Actively learning and applying new technologies and frameworks to enhance web functionalities.",
      "Participating in code reviews and adhering to development best practices to maintain code quality."
    ]
  },
  {
    "id": "2",
    "position": "Head of SEO",
    "company": "Devellar",
    "period": "2020-2022",
    "info": "",
    "duties": [
      "Team Leadership: Leading and mentoring 5 teams of SEO specialists, fostering a collaborative environment to encourage innovative solutions and professional growth.",
      "SEO Strategy Development: Crafting comprehensive SEO strategies tailored to business goals, focusing on keyword research, content optimization, and user experience improvements.",
      "Analytics and Reporting: Analyzing website performance, and preparing detailed reports to track progress and inform decision-making.",
      "Budget Management: Efficiently managing the SEO budget, ensuring resources are utilized effectively to achieve maximum ROI."
    ]
  },
  {
    "id": "3",
    "position": "SEO Specialist",
    "company": "Hexa, Devellar ",
    "period": "2014-2020",
    "info": "",
    "duties": [
      "Team Leadership: Leading and mentoring a team of SEO specialists, fostering a collaborative environment to encourage innovative solutions and professional growth.",
      "Content Optimization: Collaborating with content creators to ensure SEO best practices are integrated, enhancing content quality and relevance for target audiences.",
      "Technical SEO: Overseeing technical aspects of SEO, including site architecture, mobile optimization, and site speed enhancements.",
      "Link Building: Developing and executing link-building strategies to improve domain authority and search rankings."
    ]
  }
]